#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/YtseJam/canary-rolling/runs/run-bAJHgbtTMfVeoRpE

Waiting for the plan to start...

Terraform v1.1.6
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02fdd976dc15358bb]
aws_lb_target_group.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:targetgroup/tg-canary-rolling-deployment/7d294c9d07d5f16c]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0d4f35d428d06277e]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0d68d602a8bc714b5]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f2ca6eea23a71835]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0f0633d91370d731b]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0b59983eab883e59c]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-092bffe8da51b2f05]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0d92023b7b0a9b60a]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-008d548389d3f68d7]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-07b2d09c8ee7f7817]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-012509703aef2baf1]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0b09d3b8a3abe0d17]
module.web_sg.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-03b4abbc2aa4dc2b1]
module.lb_sg.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-046d8788965975beb]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0b59983eab883e59c1080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0440aab6a6a78f339]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-06331fa3459aa2ed9]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-092175a41bdc6623a]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:loadbalancer/app/alb-canary-rolling-deployment/6bd1bb56979a4359]
module.lb_sg.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-4117155784]
module.lb_sg.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-3627565441]
module.lb_sg.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-454230301]
module.web_sg.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-2238773635]
module.web_sg.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-4015958443]
module.web_sg.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-827565967]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-04dc82de06f5e347b]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05087b9bfb63603f3]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-029ce3333824c2765]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:listener/app/alb-canary-rolling-deployment/6bd1bb56979a4359/e9fd6f2c6ee86afd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_lb_listener.http will be updated in-place
  ~ resource "aws_lb_listener" "http" {
        id                = "arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:listener/app/alb-canary-rolling-deployment/6bd1bb56979a4359/e9fd6f2c6ee86afd"
        tags              = {}
        # (5 unchanged attributes hidden)

      ~ default_action {
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:targetgroup/tg-canary-rolling-deployment/7d294c9d07d5f16c" -> null
            # (2 unchanged attributes hidden)

          + forward {
              + stickiness {
                  + duration = 1
                  + enabled  = false
                }

              + target_group {
                  + arn    = (known after apply)
                  + weight = 0
                }
              + target_group {
                  + arn    = (known after apply)
                  + weight = 100
                }
            }
        }
    }

  # aws_lb_target_group.blue will be created
  + resource "aws_lb_target_group" "blue" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "blue-canary-rolling-deployment"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-02fdd976dc15358bb"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 10
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = "80"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_lb_target_group.green will be created
  + resource "aws_lb_target_group" "green" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "green-canary-rolling-deployment"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-02fdd976dc15358bb"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 10
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = "80"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_lb_target_group.http will be destroyed
  # (because aws_lb_target_group.http is not in configuration)
  - resource "aws_lb_target_group" "http" {
      - arn                                = "arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:targetgroup/tg-canary-rolling-deployment/7d294c9d07d5f16c" -> null
      - arn_suffix                         = "targetgroup/tg-canary-rolling-deployment/7d294c9d07d5f16c" -> null
      - connection_termination             = false -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:targetgroup/tg-canary-rolling-deployment/7d294c9d07d5f16c" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - name                               = "tg-canary-rolling-deployment" -> null
      - port                               = 80 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - target_type                        = "instance" -> null
      - vpc_id                             = "vpc-02fdd976dc15358bb" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 3 -> null
          - interval            = 10 -> null
          - matcher             = "200" -> null
          - path                = "/" -> null
          - port                = "80" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 3 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  + blue_weight      = 100
  + green_weight     = 0
  - target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:targetgroup/tg-canary-rolling-deployment/7d294c9d07d5f16c" -> null
  + tg_blue_arn      = (known after apply)
  + tg_green_arn     = (known after apply)

```
</details>
*Pusher: @adadeeeh, Action: `pull_request`*